---
kind: other
id: Methods.T:Autodesk.Revit.DB.MEPCurveType
source: html/4e3fa56a-a388-4ca2-4cc7-b28e469a8f44.htm
---
# MEPCurveType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.